export interface DataSet {
    id: number;
    inf1: string;
    inf2: string;
  }

const datasets = {
    1: [
        { id: 1, inf1: 'ii: กรุ๊ป O : 100%', inf2: 'ให้เลือดได้ทุกกรุ๊ปเลือด แต่รับเลือดได้จากกรุ๊ป O เพียงอย่างเดียว'},
    ],
    2: [
        { id: 2, inf1: 'Iᴬi: กรุ๊ป A : 100%', inf2: 'ให้เลือดกรุ๊ป A และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],
    3: [
        { id: 3, inf1: 'Iᴬi: กรุ๊ป A : 50%', inf2: 'ให้เลือดกรุ๊ป A และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 4, inf1: 'ii: กรุ๊ป O : 50%', inf2: 'ให้เลือดได้ทุกกรุ๊ปเลือด แต่รับเลือดได้จากกรุ๊ป O เพียงอย่างเดียว'},
    ],
    4: [
        { id: 5, inf1: 'Iᴮi: กรุ๊ป B : 100%', inf2: 'ให้เลือดกรุ๊ป B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],
    5: [
        { id: 6, inf1: 'Iᴮi: กรุ๊ป B : 50%', inf2: 'ให้เลือดกรุ๊ป B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 7, inf1: 'ii: กรุ๊ป O : 50%', inf2: 'ให้เลือดได้ทุกกรุ๊ปเลือด แต่รับเลือดได้จากกรุ๊ป O เพียงอย่างเดียว'},
    ],
    6: [
        { id: 8, inf1: 'Iᴬi: กรุ๊ป A : 50%', inf2: 'ให้เลือดกรุ๊ป A และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 9, inf1: 'Iᴮi: กรุ๊ป B : 50%', inf2: 'ให้เลือดกรุ๊ป B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],
    7: [
        { id: 10, inf1: 'IᴬIᴬ: กรุ๊ป A : 100%', inf2: 'ให้เลือดกรุ๊ป A และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],
    8: [
        { id: 11, inf1: 'IᴬIᴬ: กรุ๊ป A : 50%', inf2: 'ให้เลือดกรุ๊ป A และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 12, inf1: 'Iᴬi: กรุ๊ป A : 50%', inf2: 'ให้เลือดกรุ๊ป A และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],
    9: [
        { id: 13, inf1: 'IᴬIᴮ: กรุ๊ป AB : 100%', inf2: 'ให้เลือดกรุ๊ป A B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],
    10: [
        { id: 14, inf1: 'IᴬIᴮ: กรุ๊ป AB : 50%', inf2: 'ให้เลือดกรุ๊ป A B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 15, inf1: 'Iᴬi: กรุ๊ป A : 50%', inf2: 'ให้เลือดกรุ๊ป A และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],
    11: [
        { id: 16, inf1: 'IᴬIᴬ: กรุ๊ป A : 50%', inf2: 'ให้เลือดกรุ๊ป A และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 17, inf1: 'IᴬIᴮ: กรุ๊ป AB : 50%', inf2: 'ให้เลือดกรุ๊ป A B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],
    12: [
        { id: 18, inf1: 'IᴬIᴬ: กรุ๊ป A : 25%', inf2: 'ให้เลือดกรุ๊ป A และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 19, inf1: 'Iᴬi: กรุ๊ป A : 50%', inf2: 'ให้เลือดกรุ๊ป A และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 20, inf1: 'ii: กรุ๊ป O : 25%', inf2: 'ให้เลือดได้ทุกกรุ๊ปเลือด แต่รับเลือดได้จากกรุ๊ป O เพียงอย่างเดียว'},
    ],
    13: [
        { id: 21, inf1: 'Iᴮi: กรุ๊ป B : 50%', inf2: 'ให้เลือดกรุ๊ป B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 22, inf1: 'IᴬIᴮ: กรุ๊ป AB : 50%', inf2: 'ให้เลือดกรุ๊ป A B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],
    14: [
        { id: 23, inf1: 'Iᴬi: กรุ๊ป A : 25%', inf2: 'ให้เลือดกรุ๊ป A และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 24, inf1: 'Iᴮi: กรุ๊ป B : 25%', inf2: 'ให้เลือดกรุ๊ป B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 25, inf1: 'IᴬIᴮ: กรุ๊ป AB : 25%', inf2: 'ให้เลือดกรุ๊ป A B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 26, inf1: 'ii: กรุ๊ป O : 25%', inf2: 'ให้เลือดได้ทุกกรุ๊ปเลือด แต่รับเลือดได้จากกรุ๊ป O เพียงอย่างเดียว'},
    ],
    15: [
        { id: 27, inf1: 'IᴬIᴬ: กรุ๊ป A : 25%', inf2: 'ให้เลือดกรุ๊ป A และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 28, inf1: 'Iᴬi: กรุ๊ป A : 25%', inf2: 'ให้เลือดกรุ๊ป A และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 29, inf1: 'Iᴮi: กรุ๊ป B : 25%', inf2: 'ให้เลือดกรุ๊ป B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 30, inf1: 'IᴬIᴮ: กรุ๊ป AB : 25%', inf2: 'ให้เลือดกรุ๊ป A B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],
    16: [
        { id: 31, inf1: 'IᴮIᴮ: กรุ๊ป B : 100%', inf2: 'ให้เลือดกรุ๊ป B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],
    17: [
        { id: 32, inf1: 'IᴮIᴮ: กรุ๊ป B : 50%', inf2: 'ให้เลือดกรุ๊ป B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 33, inf1: 'Iᴮi: กรุ๊ป B : 50%', inf2: 'ให้เลือดกรุ๊ป B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],
    18: [
        { id: 34, inf1: 'IᴮIᴮ: กรุ๊ป B : 50%', inf2: 'ให้เลือดกรุ๊ป B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 35, inf1: 'IᴬIᴮ: กรุ๊ป AB : 50%', inf2: 'ให้เลือดกรุ๊ป A B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],
    19: [
        { id: 36, inf1: 'IᴮIᴮ: กรุ๊ป B : 50%', inf2: 'ให้เลือดกรุ๊ป B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 37, inf1: 'Iᴮi: กรุ๊ป B : 50%', inf2: 'ให้เลือดกรุ๊ป B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],
    20: [
        { id: 38, inf1: 'Iᴬi: กรุ๊ป A : 25%', inf2: 'ให้เลือดกรุ๊ป A และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 39, inf1: 'IᴮIᴮ: กรุ๊ป B : 25%', inf2: 'ให้เลือดกรุ๊ป B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 40, inf1: 'Iᴮi: กรุ๊ป B : 25%', inf2: 'ให้เลือดกรุ๊ป B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 41, inf1: 'IᴬIᴮ: กรุ๊ป AB : 25%', inf2: 'ให้เลือดกรุ๊ป A B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],
    21: [
        { id: 42, inf1: 'IᴬIᴬ: กรุ๊ป A : 25%', inf2: 'ให้เลือดกรุ๊ป A และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 43, inf1: 'IᴮIᴮ: กรุ๊ป B : 25%', inf2: 'ให้เลือดกรุ๊ป B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
        { id: 44, inf1: 'IᴬIᴮ: กรุ๊ป AB : 50%', inf2: 'ให้เลือดกรุ๊ป A B และ AB ได้เท่านั้น และรับเลือดจากกรุ๊ป O ได้'},
    ],

    // เพิ่มชุดข้อมูลตามต้องการ
  };
  
  export default datasets;

  // 1 ii & ii
  // 2 ii & IᴬIᴬ หรือ IᴬIᴬ & ii
  // 3 ii & Iᴬi หรือ Iᴬi & ii
  // 4 ii & IᴮIᴮ หรือ IᴮIᴮ & ii
  // 5 ii & Iᴮi หรือ Iᴮi & ii
  // 6 ii & IᴬIᴮ หรือ IᴬIᴮ & ii

  // 7 IᴬIᴬ & IᴬIᴬ
  // 8 IᴬIᴬ & Iᴬi หรือ Iᴬi & IᴬIᴬ
  // 9 IᴬIᴬ & IᴮIᴮ หรือ IᴮIᴮ & IᴬIᴬ
  // 10 IᴬIᴬ & Iᴮi หรือ Iᴮi & IᴬIᴬ
  // 11 IᴬIᴬ & IᴬIᴮ หรือ IᴬIᴮ & IᴬIᴬ

  // 12 Iᴬi & Iᴬi
  // 13 Iᴬi & IᴮIᴮ หรือ IᴮIᴮ & Iᴬi
  // 14 Iᴬi & Iᴮi หรือ Iᴮi & Iᴬi
  // 15 Iᴬi & IᴬIᴮ หรือ IᴬIᴮ & Iᴬi

  // 16 IᴮIᴮ & IᴮIᴮ
  // 17 IᴮIᴮ & Iᴮi หรือ Iᴮi & IᴮIᴮ
  // 18 IᴮIᴮ & IᴬIᴮ หรือ IᴬIᴮ & IᴮIᴮ

  // 19 Iᴮi & Iᴮi
  // 20 Iᴮi & IᴬIᴮ หรือ IᴬIᴮ & Iᴮi
  
  // 21 IᴬIᴮ & IᴬIᴮ